In [36]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
%matplotlib inline

In [37]:
ls

 Volume in drive C has no label.
 Volume Serial Number is C246-E1BB

 Directory of C:\Users\nduwal\Untitled Folder

04/16/2020  07:43 PM    <DIR>          .
04/16/2020  07:43 PM    <DIR>          ..
04/16/2020  11:44 AM    <DIR>          .ipynb_checkpoints
04/16/2020  07:43 PM    <DIR>          datasets
04/16/2020  06:25 PM           137,434 dataViIsualization.ipynb
04/14/2020  11:11 AM           419,971 total-and-daily-cases-covid-19.csv
04/16/2020  12:30 PM            60,769 Untitled.ipynb
               3 File(s)        618,174 bytes
               4 Dir(s)  99,418,923,008 bytes free

In [31]:
dataList = []
data = open("total-and-daily-cases-covid-19.csv") 
for i in data:
    dataList.append(i)

In [41]:
#index with same value
d = pd.DataFrame([['JOhn'], ["User"], ["Sam"]] , index = [4, 3,4])
d

      0
4  JOhn
3  User
4   Sam

In [42]:
#access same index will give all the values with the given index
d[0][4]

4    JOhn
4     Sam
Name: 0, dtype: object

In [44]:
df = pd.read_csv("datasets/time_series_covid19_confirmed_global.csv")
df.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,4/6/20,4/7/20,4/8/20,4/9/20,4/10/20,4/11/20,4/12/20,4/13/20,4/14/20,4/15/20
0,NaN,Afghanistan,33.0000,65.0000,0,0,0,0,0,0,...,367,423,444,484,521,555,607,665,714,784
1,NaN,Albania,41.1533,20.1683,0,0,0,0,0,0,...,377,383,400,409,416,433,446,467,475,494
2,NaN,Algeria,28.0339,1.6596,0,0,0,0,0,0,...,1423,1468,1572,1666,1761,1825,1914,1983,2070,2160
3,NaN,Andorra,42.5063,1.5218,0,0,0,0,0,0,...,525,545,564,583,601,601,638,646,659,673
4,NaN,Angola,-11.2027,17.8739,0,0,0,0,0,0,...,16,17,19,19,19,19,19,19,19,19

In [45]:
df.shape

(264, 89)

In [57]:
#rename a column
df = df.rename(columns={"Country/Region":"Country"})
df = df.rename(columns={"Province/State":"State"})
#outer bracket: indexing into DataFrame/ Series
#inner bracket: using python list to select multiple datas
df[["Country","State"]].tail()

                   Country                      State
259                 France  Saint Pierre and Miquelon
260            South Sudan                        NaN
261         Western Sahara                        NaN
262  Sao Tome and Principe                        NaN
263                  Yemen                        NaN

In [62]:
#DataFrame Slicing
df[200:205][["Country","State", "4/15/20"]]

          Country State  4/15/20
200  South Africa   NaN     2506
201         Spain   NaN   177644
202     Sri Lanka   NaN      238
203         Sudan   NaN       32
204      Suriname   NaN       10